app/controllers/pages_controller.rb

SELECT `shortlinks`.* FROM `shortlinks` WHERE `shortlinks`.`user_id` = 1 ORDER BY created_at DESC
---
  def home
  	@user = current_user
  	@shortlink = Shortlink.new
  	@shortlinks = current_user.shortlinks
  	@clicks = helpers.clicks(@shortlinks.first.url)