app/controllers/shortlinks_controller.rb

	def create
		@shortlink = Shortlink.new(original: shortlink_params[:original], url: SecureRandom.urlsafe_base64(6))
		@shortlink.user = current_user
		if @shortlink.save
---
INSERT INTO `shortlinks` (`user_id`, `url`, `original`, `created_at`, `updated_at`) VALUES (1, 'O_SB86Xb', 'https://paper.dropbox.com/doc/Build-a-URL-shortener-BdG2JwuLz5jG4ke1kf4Ye', '2022-09-08 07:55:50.681613', '2022-09-08 07:55:50.681613')

	def redirect
		url = Shortlink.find_by(url: params[:url])
		url.clicks += 1
		url.save
---
SELECT `shortlinks`.* FROM `shortlinks` WHERE `shortlinks`.`url` = 'O_SB86Xb' LIMIT 1
UPDATE `shortlinks` SET `shortlinks`.`url` = 'gzeIAqU3', `shortlinks`.`updated_at` = '2022-09-08 07:57:40.912129', `shortlinks`.`clicks` = 1 WHERE `shortlinks`.`id` = 1